using System;

namespace UServer3.Rust.Data
{
    public enum EPrefabUID : UInt32
    {
        BasePlayer      = 4108440852, // Префаб игрока

        OreBonus        = 2931121794, // Светящаяся фентифлюшка
        // Melee Weapons
        WoodenSpear     = 2828546575,  // Деревянное копьё
        StoneSpear      = 1943636975, // Каменное копьё
        Machete         = 2942508801,  // Мачете
        LongSword       = 3395979968, // Одноручный меч
        SalvagedSword   = 1663991785,  // Двуручный меч
        SalvagedCleaver = 3340056040,  // Двуручное лезвие
        BoneKnife       = 1483241467, // Костянной нож
        BoneClub        = 3097934597, // Костянная дубинка
        Rock            = 3940068399,  // Камень
        Hatchet         = 365233245,    // Железный топор
        Hummer         = 388861612,    // Киянка
        SalvagedHatchet = 3826414185, // Трофейный топор
        StonePixAxe     = 1450582435, // Каменная кирка
        StoneHatchet    = 3540736579,  // Каменный топор
        PixAxe          = 1587077350,  // Железная кирка
        SalvagedPixAxe  = 109244214, // Ледоруб
        Satchel         = 2671523489, // Сочель
        SalvagedHummer  = 1744180387, // Двуручный молот
        Torch           = 1543342082, // Факел

        // Range Weapons
        Bow             = 2836331625, // Лук
        CrossBow        = 2727391082, // Арбалет
        CompoundBow        = 1537401592, // Блочный лук
        NailGun         = 4279856314,  // Гвоздомёт

        LR300           = 844375121, // LR300
        Bolt            = 1665481300, // Болтовка
        AK47            = 1978739833, // Калаш
        SemiRifle       = 563371667,   // Берданка
        Pyton           = 3305012504,  // Питон
        Revolver        = 2477536592, // Револьвер
        MP5             = 2545523575, // MP5
        RPG             = 601440135, // РПГ
        P90             = 418706577,  // П90
        DoubleShotgun   = 3474489095,  // Двухствольный Дробовик
        Tomphson        = 3243900999, // Томсон
        PumpShotgun     = 554582418, // Помповый Дробовик
        M249            = 1440914039,  // Пулемет
        Shotgun         = 4262383355, // Самодельный Дробовик
        Eoka            = 2176761593, // Самодельная пуколка - недо дробовик
        SMG             = 3759841439,  // SMGшка
        Spas             = 1877401463,  // Спас
        L96             = 2620171289,  // ???
        M39             = 1517089664,  // ???
        Bereta             = 2293870814,  // ???
        
        Toolgun             = 417347909,  // ????
        Waterbucket             = 1182699531,  // ????
        Bandage             = 1383987667,  // ????
        GrenadeBeancan             = 3654150932,  // ????
        GranadeF1             = 45697420,  // ????
        Flamethrower             = 3717106868,  // ????
        GrenadeLauncher             = 1233562048,  // ????
        Knife             = 1362182970,  // ????
        Pitchfork             = 1009417331,  // ????
        Sickle             = 124547093,  // ????????
        Skull             = 1140399555,  // ????????
        KnifeCombat             = 327944951,  // ????????
        Mace             = 2927698044,  // ????????
        MilitaryFlamethrower             = 1710208928,  // ????????
        Paddle             = 1850172004,  // ????????
        ShotgunWaterpipe             = 2696589892,  // ????????
        HoseTool             = 3568270288,  // ????????
        JackHammer             = 3537156861,  // ????????
        KeyCard             = 3773357817,  // ????????
        KeyCardBlue             = 675407027,  // ????????
        KeyCardGreen             = 1317896088,  // ????????
        KeyCardRed             = 3985212893,  // ????????
        SyringeMedical             = 283937635,  // ????????
        Pager             = 2918467232,  // ????????
        WireTool             = 4258987144,  // ????????
        Binocular             = 436023350,  // ????????
        C4             = 1915331115,  // ????????
        Detonator             = 3503830994,  // ????????
        Bobber             = 2984848657,  // ????????
        FishingRod             = 2057865657,  // ????????
        FlashLight             = 72718095,  // ????????
        GeigerCounter             = 47304962,  // ????????
        
        LargeStorageBox = 3439001196,
        StorageBox      = 2014947887,
        Cake      = 1980046596,
        Chainsaw      = 1802634117,
    }
}